# Основными арифметическими операциями являются: сложение ('+'), вычитание ('-'), умножение ('*') и деление ('/'). Я решил добавить еще и возведение в степень.
print("Список операций: \n1. Сложение двух чисел\n2. Вычитание первого числа из второго\n3. Перемножение двух чисел" # добавляем сопроводительное сообщение
"\n4. Деление первого числа на второе\n5. Возведение первого числа в степень второго числа") # добавляем сопроводительное сообщение о возможных операциях
print("Введите первое число: ") # добавляем сопроводительное сообщение
number_one = float(input()) # реализуем пользовательский ввод первого числа
print("Введите второе число: ") # добавляем сопроводительное сообщениеЫыы
number_two = float(input()) # реализуем пользовательский ввод второго числа
print("Введите номер операции из выше предложенного списка: ") # добавляем сопроводительное сообщение
operation_name = int(input()) # реализуем пользовательский ввод операции
match(operation_name): # добавляем оператор выбора для значения переменной операции
    case 1 : # при случае, когда операция равна 1, то
        print("Результат сложения:",number_one + number_two) # производим сложение и выводим результат операции
    case 2: # при случае, когда операция равна 2, то
        print("Результат вычитания:",number_one - number_two) # производим вычитание и выводим результат операции
    case 3: # при случае, когда операция равна 3, то
        print("Результат умножения:", number_one * number_two) # производим умножение и выводим результат операции
    case 4: # при случае, когда операция равна 4, то
        if (number_two == 0): # реализуем условный оператор, когда второе число равно 0 (в калькуляторе деление на нуль - ошибка)
            print("Ошибка! Введите другое значение числа.") # если второе число равно 0, то выводим сообщение об ошибке
        else: # если число не равно 0, то выполняется другой оператор
            print("Результат деления:", number_one / number_two) # иначе производим деление и выводим результат операции
    case 5: # при случае, когда операция равна 5, то
        print("Результат возведения в степень:", pow(number_one, number_two)) # производим возведение в степень( функция pow) и выводим результат операции
    case _: # при случае, когда операция равна иному значению, то
        print("Ошибка! Данной операции не существует. Попробуйте ввести операцию из списка") # выводим сообщение об ошибке
